# Ввод и вывод данных. 
* Pandas может читать данные из широкого спектра источников, и имеет отличную онлайн-документацию.
* Точно знать путь к файлу. 
* Для некоторых данных может потребоваться пароль (SQL).

In [1]:
import numpy as np 
import pandas as pd

In [2]:
# Как узнать текущую папку
%pwd

'/Users/user/ML Python/03-Pandas'

In [3]:
ls

00-SPractice.ipynb
00-Series.ipynb*
01-DPractice.ipynb
01-DataFrames.ipynb*
02-Conditional-Filtering.ipynb*
02-Practice.ipynb
03-Useful-Methods.ipynb*
03-Useful-Methods_Practice.ipynb
04-Missing-Data.ipynb*
04-PMissing-Data.ipynb
05-Groupby-Operations-and-MultiIndex.ipynb*
05-PGroupby-Operations.ipynb
06-Combining-DataFrames.ipynb*
06-PCombining-DataFrames.ipynb
07-PText-Methods.ipynb
07-Text-Methods.ipynb*
08-PTime-Methods.ipynb
08-Time-Methods.ipynb*
09-Inputs-and-Outputs.ipynb*
09-PInputs-and-Outputs.ipynb
10-Pivot-Tables.ipynb*
11-Pandas-Project-Exercise.ipynb*
12-Pandas-Project-Exercise-Solution.ipynb*
RetailSales_BeerWineLiquor.csv*
Sales_Funnel_CRM.csv*
__pycache__/
example.csv*
example.xlsx*
hotel_booking_data.csv*
movie_scores.csv*
mpg.csv*
my_excel_file.xlsx*
new_file.csv*
new_workbook.xlsx*
newfile.csv*
reshaping_pivot.png*
sample_table.html*
simple.html*
tips.csv*

In [7]:
# или без Pandas
import os
os.getcwd()

'/Users/user/ML Python/03-Pandas'

--- 
## СSV files

In [10]:
df = pd.read_csv('/Users/user/ML Python/03-Pandas/example.csv', header=None)
df

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [11]:
# если хотим колонку сделать индексом 
df = pd.read_csv('/Users/user/ML Python/03-Pandas/example.csv', index_col=0)
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [17]:
# сохранение файла в текущей папке.
df.to_csv('/Users/user/ML Python/03-Pandas/example2.csv', index=True) # или можно просто указать название файла.

In [18]:
df = pd.read_csv('example2.csv')
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

---
## HTML files
* Не все таблицы на веб-сайте могут быть доступны в виде HTML-таблиц
* Некоторые веб-сайты могут блокировать Ваши попытки извлечь HTML с их сайта с помощью Pandas. 
* Эффективнее использовать API

In [ ]:
pip install lxml

In [30]:
df = pd.read_html('https://en.wikipedia.org/wiki/World_population')
len(df)

27

In [39]:
table = df[2]
table

,Region,Density (inhabitants/km2),Population (millions),Most populous country,Most populous city (metropolitan area)
0,Asia,104.1,4641,"1,439,090,595 – India","13,515,000 – Tokyo Metropolis (37,400,000 – Gr..."
1,Africa,44.4,1340,"0,211,401,000 – Nigeria","09,500,000 – Cairo (20,076,000 – Greater Cairo)"
2,Europe,73.4,747,"0,146,171,000 – Russia, approx. 110 million in...","13,200,000 – Moscow (20,004,000 – Moscow metro..."
3,Latin America,24.1,653,"0,214,103,000 – Brazil","12,252,000 – São Paulo City (21,650,000 – São ..."
4,Northern America[note 1],14.9,368,"0,332,909,000 – United States","08,804,000 – New York City (23,582,649 – New Y..."
5,Oceania,5,42,"0,025,917,000 – Australia","05,367,000 – Sydney"
6,Antarctica,~0,0.004[86],N/A[note 2],"00,001,258 – McMurdo Station"

In [40]:
table = table.drop(6, axis=0)
table

,Region,Density (inhabitants/km2),Population (millions),Most populous country,Most populous city (metropolitan area)
0,Asia,104.1,4641,"1,439,090,595 – India","13,515,000 – Tokyo Metropolis (37,400,000 – Gr..."
1,Africa,44.4,1340,"0,211,401,000 – Nigeria","09,500,000 – Cairo (20,076,000 – Greater Cairo)"
2,Europe,73.4,747,"0,146,171,000 – Russia, approx. 110 million in...","13,200,000 – Moscow (20,004,000 – Moscow metro..."
3,Latin America,24.1,653,"0,214,103,000 – Brazil","12,252,000 – São Paulo City (21,650,000 – São ..."
4,Northern America[note 1],14.9,368,"0,332,909,000 – United States","08,804,000 – New York City (23,582,649 – New Y..."
5,Oceania,5,42,"0,025,917,000 – Australia","05,367,000 – Sydney"

In [41]:
table = table.drop('Most populous country', axis=1)
table

,Region,Density (inhabitants/km2),Population (millions),Most populous city (metropolitan area)
0,Asia,104.1,4641,"13,515,000 – Tokyo Metropolis (37,400,000 – Gr..."
1,Africa,44.4,1340,"09,500,000 – Cairo (20,076,000 – Greater Cairo)"
2,Europe,73.4,747,"13,200,000 – Moscow (20,004,000 – Moscow metro..."
3,Latin America,24.1,653,"12,252,000 – São Paulo City (21,650,000 – São ..."
4,Northern America[note 1],14.9,368,"08,804,000 – New York City (23,582,649 – New Y..."
5,Oceania,5,42,"05,367,000 – Sydney"

In [42]:
table.columns = ['Region','Density (ppl/km2)','Population (mln)', 'Most populous city']
table

,Region,Density (ppl/km2),Population (mln),Most populous city
0,Asia,104.1,4641,"13,515,000 – Tokyo Metropolis (37,400,000 – Gr..."
1,Africa,44.4,1340,"09,500,000 – Cairo (20,076,000 – Greater Cairo)"
2,Europe,73.4,747,"13,200,000 – Moscow (20,004,000 – Moscow metro..."
3,Latin America,24.1,653,"12,252,000 – São Paulo City (21,650,000 – São ..."
4,Northern America[note 1],14.9,368,"08,804,000 – New York City (23,582,649 – New Y..."
5,Oceania,5,42,"05,367,000 – Sydney"

In [45]:
table2 = df[6].set_index('Rank')
table2

                    Country  Population  Area (km2)  Density (pop/km2)
Rank
1                 Singapore     5921231         719               8235
2                Bangladesh   165650475      148460               1116
3     Palestine[note 3][99]     5223000        6025                867
4            Taiwan[note 4]    23580712       35980                655
5               South Korea    51844834       99720                520
6                   Lebanon     5296814       10400                509
7                    Rwanda    13173730       26338                500
8                   Burundi    12696478       27830                456
9                    Israel     9402617       21937                429
10                    India  1389637446     3287263                423

In [46]:
table.to_html('simple_table.html',index=False)

In [48]:
df = pd.read_html('simple_table.html')
df

[                     Region  Density (ppl/km2)  Population (mln)  \
 0                      Asia              104.1              4641
 1                    Africa               44.4              1340
 2                    Europe               73.4               747
 3             Latin America               24.1               653
 4  Northern America[note 1]               14.9               368
 5                   Oceania                5.0                42

                                   Most populous city
 0  13,515,000 â Tokyo Metropolis (37,400,000 â...
 1  09,500,000 â Cairo (20,076,000 â Greater C...
 2  13,200,000 â Moscow (20,004,000 â Moscow m...
 3  12,252,000 â SÃ£o Paulo City (21,650,000 â...
 4  08,804,000 â New York City (23,582,649 â N...
 5                              05,367,000 â Sydney  ]

---
## Excel files
* Pandas может читать и записывать только обычные данные, он не сможет прочитать макросы, визуализации и формулы в ячейках. 
* Pandas работает с Excel-файлом как со словарем, в котором ключи словаря - это названия листов, а значения словаря - это данные листов в виде DataFrame. 
* Чтобы работать с Excel-файлами в Pandas, нужно установить дополнительные библиотеки.

In [7]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
     |████████████████████████████████| 250 kB 1.7 MB/s eta 0:00:01
Collecting et-xmlfile
  Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
WARNING: You are using pip version 21.2.4; however, version 25.1.1 is available.
You should consider upgrading via the '/Library/Developer/CommandLineTools/usr/bin/python3 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [10]:
df = pd.read_excel('my_excel_file.xlsx', sheet_name='First_Sheet', engine='openpyxl')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
wb = pd.ExcelFile('my_excel_file.xlsx')
wb.sheet_names

['First_Sheet']

In [12]:
excel_sheet_dict = pd.read_excel('my_excel_file.xlsx', sheet_name=None, engine='openpyxl')
type(excel_sheet_dict)

dict

In [13]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [15]:
our_df = excel_sheet_dict['First_Sheet']

In [16]:
our_df.to_excel('example.xlsx', sheet_name='First_Sheet')

--- 
## SQL 
* Pandas может читать и записывать данные в базу данных SQL, используя драйвер и библиотеку sqlalchemy в Python. 
1. Смотря к какой базе подключаемся, необходимо скачать соответстующий драйвер. 
* PostgreSQL - psycopg2
* MySQK - pymysql
* MS SQL Server - pyodbc
2. Далее пользуемся библиотекой sqlalcheme для подключения к базе данных. 

3. Следом можно применить метод read_sql для отправки SQL-запросов. 
* Pandas может считывать таблицы целиком и класть их в датафреймы. Или же возвращать результаты запросов: SELECT * FROM table

In [ ]:
%pip install sqlalchemy

In [2]:
from sqlalchemy import create_engine

In [3]:
temp_db = create_engine('sqlite:///:memory:')

In [4]:
df = pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4,4)), columns=['a','b','c','d'])
df

    a   b   c   d
0  10  55  29  69
1  35  63  92  83
2  52  42  62  18
3  36  11   1  24

In [5]:
df.to_sql(name='new_table', con=temp_db)

4

In [7]:
new_df = pd.read_sql(sql='new_table',con=temp_db)
new_df

   index   a   b   c   d
0      0  10  55  29  69
1      1  35  63  92  83
2      2  52  42  62  18
3      3  36  11   1  24

In [8]:
result = pd.read_sql_query(sql='SELECT a,c FROM new_table', con=temp_db)
result

    a   c
0  10  29
1  35  92
2  52  62
3  36   1